tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "libsql/sqld"
tap "microsoft/git"
tap "microsoft/mssql-release"
tap "ngrok/ngrok"
tap "nicoverbruggen/cask"
tap "nikitabobko/tap"
tap "shivammathur/extensions"
tap "shivammathur/php"
tap "tursodatabase/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# OpenType text shaping engine
brew "harfbuzz"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Cross-platform ncurses Spotify client written in Rust
brew "ncspot"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3.0"
# Framework for layout and rendering of i18n text
brew "pango"
# General-purpose scripting language
brew "php"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql17"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# PCOV PHP extension
brew "shivammathur/extensions/pcov@8.4"
brew "tursodatabase/tap/turso"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Customise mouse behavior
cask "linearmouse"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
